articles/clang_vs_gcc_for_emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-01-01 Mon 21:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Clang vs. GCC for building Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Lei Zhao" />
<link type="text/css" href="../styles/syntax-highlight.css" rel="stylesheet"/>
<link type="text/css" href="../styles/layout.css" rel="stylesheet"/>
</head>
<body>
<div id="content">
<h1 class="title">Clang vs. GCC for building Emacs</h1>
<input id="disqus-identifier" value="LFJ103"></input>


<p>
Several days ago, I tried to play with Web Assembly and found out it
requires Clang to run.  Clang has become the default compiler for many
BSD-based operating systems.  And I was told from multiple sources
that it is faster than GCC both in compilation time and binary speed.
However, I had no personal experience with it and thus set out to gain
some.
</p>

<p>
I am no expert in performance testing, so don&rsquo;t blame me if I made
some mistakes.
</p>

<p>
I used the Bash shell keyword <code>time</code> to obtain time consumed by the
building process.  I added the option <code>-rtlib=compiler-rt</code> to
<code>LDFLAGS</code>, since Clang would complain <code>undefined reference to
`__muloti4'</code> without it (see <a href="https://bugs.llvm.org/show_bug.cgi?id=16404">bug</a>).  Clang 5.0 also provides a linker
called <code>lld</code> and claims that it is faster than the built-in linker.
As per <a href="https://lld.llvm.org/#using-lld">instruction</a>, I added <code>-fuse-ld=lld</code> to <code>LDFLAGS</code> as a third
group.
</p>

<p>
The following was the commands I used for each group.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-comment-delimiter"># </span><span class="org-comment">for GCC</span>
<span class="org-keyword">time</span> make bootstrap
<span class="org-comment-delimiter"># </span><span class="org-comment">for Clang without lld</span>
<span class="org-keyword">time</span> make <span class="org-variable-name">CC</span>=clang <span class="org-variable-name">LDFLAGS</span>=<span class="org-string">'-rtlib=compiler-rt'</span> bootstrap
<span class="org-comment-delimiter"># </span><span class="org-comment">for Clang with lld</span>
<span class="org-keyword">time</span> make <span class="org-variable-name">CC</span>=clang <span class="org-variable-name">LDFLAGS</span>=<span class="org-string">'-fuse-ld=lld -rtlib=compiler-rt'</span> bootstrap
</pre>
</div>

<p>
The following was the results.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">10m39.673s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">9m47.504s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m25.528s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make check
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">2m3.138s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">0m33.844s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m4.332s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make <span class="org-variable-name">CC</span>=clang <span class="org-variable-name">LDFLAGS</span>=<span class="org-string">'-rtlib=compiler-rt'</span> bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">10m21.240s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">9m27.012s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m27.908s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make check
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">2m5.838s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">0m35.584s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m4.636s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make <span class="org-variable-name">CC</span>=clang <span class="org-variable-name">LDFLAGS</span>=<span class="org-string">'-fuse-ld=lld -rtlib=compiler-rt'</span> bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">10m5.253s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">9m12.172s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m27.560s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make check
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">2m0.545s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">0m31.992s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m4.380s</td>
</tr>
</tbody>
</table>


<p>
On the next day, I re-compiled Emacs using GCC to compare binary
functionality but accidentally found out that GCC compiled much faster
than last time.  I don&rsquo;t know what exactly the boost came from. I
surmise that it was due to reboot.  Therefore, I ran a follow-up and
the following was results on the second day.
</p>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">9m59.694s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">9m10.776s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m24.756s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make <span class="org-variable-name">CC</span>=clang <span class="org-variable-name">LDFLAGS</span>=<span class="org-string">'-fuse-ld=lld -rtlib=compiler-rt'</span> bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">9m25.487s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">8m38.408s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m24.996s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">9m52.320s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">9m5.648s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m23.000s</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash"><span class="org-keyword">time</span> make <span class="org-variable-name">CC</span>=clang <span class="org-variable-name">LDFLAGS</span>=<span class="org-string">'-fuse-ld=lld -rtlib=compiler-rt'</span> bootstrap
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">real</td>
<td class="org-left">9m47.568s</td>
</tr>

<tr>
<td class="org-left">user</td>
<td class="org-left">8m58.880s</td>
</tr>

<tr>
<td class="org-left">sys</td>
<td class="org-left">0m26.516s</td>
</tr>
</tbody>
</table>

<p>
In conclusion, Clang, particularly with <code>lld</code>, is slightly faster.
</p>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lei Zhao</p>
<p class="date">Created: 2018-01-01 Mon 21:05</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
